# LEET CODE
## Problem-626: Exchange Seats

Class: Medium

Source: https://leetcode.com/problems/exchange-seats

## Description
Table: Seat
| Column Name | Type    |
|-------------|---------|
| id          | int     |
| student     | varchar |

- id is the primary key (unique value) column for this table.
- Each row of this table indicates the name and the ID of a student.
- id is a continuous increment.

## To Do
Write a solution to swap the seat id of every two consecutive students. If the number of students is odd, the id of the last student is not swapped.

Return the result table ordered by id in ascending order.

The result format is in the following example.

## Example

Input: 

Seat table:
| id | student |
|----|---------|
| 1  | Abbot   |
| 2  | Doris   |
| 3  | Emerson |
| 4  | Green   |
| 5  | Jeames  |

Output: 
| id | student |
|----|---------|
| 1  | Doris   |
| 2  | Abbot   |
| 3  | Green   |
| 4  | Emerson |
| 5  | Jeames  |

Explanation: 
- Note that if the number of students is odd, there is no need to change the last one's seat.

## Importing

In [1]:
import pandas as pd
from pandasql import sqldf

## Define Schema

In [2]:
data = {
    'id': [1, 2, 3, 4, 5],
    'student': ['Abbot', 'Doris', 'Emerson', 'Green', 'Jeames']
}

Seat = pd.DataFrame(data)

Seat

   id  student
0   1    Abbot
1   2    Doris
2   3  Emerson
3   4    Green
4   5   Jeames

## Task

In [12]:
# Define the SQL query
query = """
WITH student_log AS (
SELECT 
    id, 
    student, 
    LEAD(student, 1) OVER (ORDER BY id) AS next_student,
    LAG(student, 1) OVER (ORDER BY id) AS prev_student
FROM Seat
)
SELECT 
    id,
    CASE 
        WHEN id = (SELECT COUNT(id) FROM Seat) AND id%2 != 0 THEN student
        WHEN id % 2 = 0 THEN prev_student 
        ELSE next_student END AS student
FROM student_log
ORDER BY id ASC
;
"""

# Excute the query using pandasql
result = sqldf(query, env={'Seat':Seat})

# Display the result dataframe
display(result)

   id  student
0   1    Doris
1   2    Abbot
2   3    Green
3   4  Emerson
4   5   Jeames